[
	{
		"approved_at_utc": null,
		"subreddit": "nosleep",
		"selftext": "I was raised in a foster home. I don’t have many memories from the time I spent with my biological parents, but I know they seriously mistreated us. Both me and my sister were both severely malnourished when the state took us in, and it stunted our growth pretty bad. My sister is about five feet tall, and I’m about an inch shorter.\n\nBeing raised in a foster home, I was taught just how important it is to be mindful of others and care for those less fortunate. I’ve spent most of my adult life working with various charities. I also work as a nurse at a private hospital, and I spend most of my days providing palliative care. I hate to sound braggy, but I think I can safely say that I’m pulling my own weight. I care. That’s what I do.\n\n&#x200B;\n\nSo it is no wonder that, once in a while, I care more than I should.\n\n&#x200B;\n\nI was coming home from work. It was a pretty late Thursday and most shops were closed, apart from a single convenience store. I bought myself a salad and a diet coke and followed the main street for about a block. I usually walk to and from work.\n\nWith most shops closed, the place is a ghost town. Most bars and clubs are on a different street, but who goes clubbing on a Thursday anyway? No, apart from an older woman walking her dog, I was alone. I didn’t mind, I’d walked those streets a thousand times.\n\nThere’s a fork in the road where they’ve put up pedestrian lights. Four roads meet, and it is by far the most infuriating intersection in town. As I rounded the corner, I saw someone standing there, pressing the button to cross.\n\n&#x200B;\n\nIt was a kid. It wouldn’t matter how many times he pressed the button to cross, that light was broken. But he just stood there, crying, pressing the button. There wasn’t a single car on the road, but you know how kids are.\n\nHe was about seven years old, with Asian features and a pale complexion. His eyes were red from crying, and he was shivering. It was mid-February, and there was still plenty of snow outside, yet he looked ready for summer.\n\n“Come on!” he cried. “Just… come on!”\n\nHe kept pushing the button, but nothing happened. I walked up to him and crouched down to meet his eyes.\n\n“Hey there” I said. “Are you okay? Where are your parents?”\n\nHe just pointed down the street and shook his head.\n\n“They went ahead” he said. “They left me.”\n\n“I’m sure it was a mistake. Wanna go find them?”\n\n“You can’t cross!” he cried. “It has to turn green!”\n\n“The light is broken, sweetie. You’ll be stuck here forever if you wait for it to turn green.”\n\n“Then how do I know when to cross?” he sniffled.\n\nI took his cold hand, met his brown eyes, and smiled.\n\n“Just come with me. We’ll find them.”\n\nThat’s how I first met Fredric, or Fred. Such an adult name for such a scared little kid.\n\n&#x200B;\n\nLong story short, we didn’t find them. We searched for hours. When I called the police, I was told no one had reported a missing boy. He wasn’t being looked for, yet. As someone who had a vague memory of abusive and neglectful parents, I got a chill down my spine. Was this my time to step up and help out someone like me?\n\nChild protective services were eager to help, but the kid didn’t want to go with them. He wanted to stay with me. I had Friday off, and then there was the weekend, so I didn’t mind. I had to fill out a few forms, and they had to come back to my apartment to make sure it was safe, but that was it. It was just a temporary solution anyway, so they were pretty relaxed about it. A temporary foster home. What goes around comes around.\n\nDuring that whole time, that little hand never let go of me. He needed me.\n\n&#x200B;\n\nAt the end of the night, he came home with me. I offered him my bed while I slept on the couch, but he refused. Instead, he wanted to sleep next to me. Of course he could. He had a shower, and I made him some juice and toast. We watched cartoons in bed until we fell asleep. That first night I stroked his hair and sang to him, like my foster parents had done to me all those years ago. He looked so peaceful.\n\nIt wasn’t peaceful for long though. Sometime during the night, I woke up to the sound of someone vomiting. I rushed into the bathroom and switched on the lights, but it stayed dark. Fred was bent over the toilet with shallow breaths.\n\n“The light” he coughed. “It’s broken.”\n\n“I’ll fix it, sweetie. Are you okay?”\n\n“I’m allergic to oranges. I didn’t… I didn’t want you to get mad at me.”\n\nI comforted him as best as I could. I sat next to him for at least an hour. My legs got these square marks from the bathroom tiles.\n\n&#x200B;\n\nThe next day, Fred stayed in bed. He said he was really tired, and that he just wanted to rest. He asked me to keep the blinds closed and the door shut, and to leave him some water. I was worried sick. At first I thought he had a fever, but then again, it could just be a stressed stomach. I figured he had to be going through hell, not knowing where his parents were, or why they’d left him. I put on the TV, left him some water, and told him I’d be in the next room whenever he wanted me to make him something.\n\nHe stayed in bed until at least 6pm. All day. When he finally got up he seemed in much better spirits, and he munched down a plate of sausage and macaroni in an instant. He was so much more cheerful. A man from CPS came by with some extra clothes earlier in the day, so Fred got a fresh change. Looking at Fred that night, you couldn’t tell he’d been abandoned the day before. He was just an ordinary kid, eager to explore the world and make up new adventures.\n\nI brought an old butterfly net, and we went to catch moths in the park. I got us both a soda, and we walked around town playing Pokémon Go. Fred had a lot of opinions on the best evolution of Eevee, and he wouldn’t shut up about his favorite Pokémon; Gliscor.\n\n&#x200B;\n\nWe were about to head back at 9pm, but Fred wanted a last walk by the monkey bars before we went home. I caved. We took the long route back home, so we’d walk past the monkey bars. Fred was way too happy for a kid who’d just lost his parents, but then again, maybe it wasn’t that much of a loss.\n\nThere was another kid playing at the monkey bars. He was maybe a year older, with shoulder-length strawberry blonde hair. I thought it was a girl at first, but Fred seemed to know him.\n\n“Mom! Mom!” Fred called. “It’s Derek! Can I play with him?”\n\nMom? I was already ‘mom’? I didn’t want to correct him, but that word hit me like a brick. Dumbfounded, I just nodded. Of course he had friends, but they were out way too late for kids this young.\n\nThe two of them laughed and played until well past 10pm, when I convinced him it was time to go. They could play again tomorrow. It was too late. We got home, I drank a glass of orange juice, and we turned in for the night.\n\n&#x200B;\n\nThe next day, I woke up at 11 am. I’d slept for almost 12 hours. The kind of sleep where, when you wake up, you barely know who you are anymore. I had an explosive headache, and I stumbled into the bathroom. I barely even thought about where Fred was. The bathroom light was still broken. My headache was so bad that I threw up. I tried my best to clean it up in the dark, but it was hard. The smell remained, even after a shower.\n\nI came out into the living room to find Fred and his friend Derek playing. Derek had brought an iPad, and they were taking turns looking at YouTube videos. They’d covered the windows to darken the room and made a blanket fort. Before I even got the time to question it, Fred hugged me.\n\n“I made you lunch” he said. “It’s in the fridge. I didn’t want to wake you.”\n\nI kissed his head and checked my phone. Four missed calls, all from CPS. I opened the fridge, but the light didn’t turn on. I could barely see anything. The fridge was still running. It was cold, but the light was busted. With the covered windows, and no other lights on, it was almost impossible to see what he’d made. Using my phone as a flashlight, I found a plate of ham and cheese sandwiches.\n\nThen, as I closed the fridge, I noticed two shining eyes looking back at me. Like the eyes of a cat, reflective, before they disappeared into the blanket fort. I barely had the time to register it before Fred interrupted my thoughts. He was standing in front of me, hands behind his back, looking worried.\n\n“Are you okay?” he asked, rocking back and forth.\n\n“I’m fine” I lied. “It’s just… the light is broken”\n\n“The light is broken” snickered Derek from the blanket fort.\n\n“Is Derek allowed to be here?” I asked. “We should call his parents.”\n\n“They’re working” said Derek from the fort. “But okay.”\n\n“You can have the number” said Fred. “Here.”\n\nHe scribbled it on a post-it and handed it to me. The kids were so eager to get back to playing that I didn’t know how to handle it.\n\n&#x200B;\n\nI called Derek’s parents. They said everything was fine, and that he could stay as long as he wanted. They didn’t ask any follow-up questions, and they barely even cared about who I was or where I lived. They seemed irresponsible, quick to anger, and very busy. I couldn’t blame Derek for not wanting to spend time with them.\n\nOnce it was dinner time I thought about making a chicken salad. Fred suggested we get pizza. Derek agreed. They were playing games on the iPad and watching cartoons, and as I knew this was a temporary arrangement, I couldn’t say no. They asked if they could stay at home while I got the pizza, and I said it was okay as long as they didn’t answer the door.\n\n“Thanks mom” said Fred. “You’re the best.”\n\nIt didn’t sit right with me. I was just about to head out, but I turned at the door and met his eyes.\n\n“I’m not your mom, Fred”\n\nI don’t know why I said that. His gleeful expression faded from his eyes. With a completely deadpan expression, he responded.\n\n“Fine.”\n\n&#x200B;\n\nWhen I got back, the front door was unlocked. I hurried inside. Every single light in the apartment was broken by now. Every door was open. Every window was covered, and there was no one there. I dropped the pepperoni pizzas flat on the floor and called the police. My fingers trembled so bad I could barely type the number.\n\nA patrol car came by, and I talked to two officers. Apparently, there were still no reports of a missing child. They looked through the apartment, checked the blanket fort, and promised to search the area. There was nothing more to do at the moment. We called CPS, and I was told to update them as soon as I could. If Fred was some sort of flight risk he might need to stay at a more secure location.\n\n&#x200B;\n\nLater that night, I was alone in a dark apartment. Not a single light was working. As I sat down on my bed, I couldn’t help but to cry. I was so disappointed in myself for not being able to take care of this kid, to not being able to just live with that title of ‘mom’ without opening my stupid mouth. Of course he was upset, he was staying with a stranger. A stranger who didn’t want to be his mom. I couldn’t blame him.\n\nBy midnight, I was exhausted. I just laid in bed, counting down from a thousand, hoping it’d put me to sleep. It didn’t.\n\n&#x200B;\n\nSomewhere around 2am I heard a noise from the living room. A chair moved. I hurried out, using my phone as a flashlight.\n\nI’ll never forget that sight. There were dozens of little eyes reflecting the light of my camera. At least 13 kids in the middle of my living room, cramped together. How did I not hear them enter?\n\nSitting on a chair, facing the bedroom door, was Fred. He’d dressed up in a black shirt with a white tie and black jeans. It was something an adult would wear, not a kid. He got up on the kitchen chair, making himself just as tall as me.\n\n“What… what is this?” I stammered.\n\nThere were all kinds of kids. Some as young as 4, maybe 5 years old. The oldest no more than 11.\n\n“A dignified and erstwhile undertaking” said Fred.\n\nHe had a lower voice than before. His hair was combed and parted. Cared for.\n\n“Turn the fucking light off” he continued, pointing at me with a stiff finger.\n\nThey pushed me down to the floor. Tiny hands held me down and covered my mouth. Fred towered above me with a kitchen knife as my phone went dark. The light broke. Even with no light in the room, their little eyes shone. I could see their perfectly white teeth, framed by blood red gums.\n\n“Pay attention and be respectful” Fred said, “and there’s a chance you’ll get out of this.”\n\nHe made the rules perfectly clear. When they needed me, I’d answer the phone or turn away anyone who came knocking. I’d make up excuses. I’d do what I was told. I’d drink my orange juice and nod. That was it. In return, they wouldn’t kill me. This wasn’t “Fred” anymore. This was “Fredric”.\n\nI was locked in the bathroom. In the course of less than half an hour I’d gone from a grieving foster parent to a prisoner in my own apartment.\n\n&#x200B;\n\nThis continued for several days. The lights were still broken, so I lived in complete darkness. Every now and then the phone rang, and a kid came in to let me answer. They all had knives, and if I stepped out of line they were ready to make short work of me. They all seemed so chipper and upbeat, not at all like a normal kid would be in this situation. There was something deeply wrong with them. These weren’t normal kids.\n\nIn a couple of days, I only got a few calls. Once from work, where I had to explain I was really sick. I could barely breathe, having a knife pressed against my jugular. Two calls from the CPS, to make sure everything was fine and that I would come down to sign some papers at the end of the next 7-day period. One call from a work colleague who wanted to check if they should bring me anything.\n\nI would hear the kids go quiet at times. Moments later, the door would open. Sometimes I’d hear an adult voice, sometimes I’d just hear a dragging noise. Once, I heard a man asking about “the little girl”, only to be instantly silenced. I think they killed him.\n\nSometimes, they’d all just start laughing. It happened spontaneously, and in unison. Empty-your-lungs kind of belly laughter, from a dozen kids, all at once. Some of them wouldn’t even laugh, they’d shriek and stomp.\n\n&#x200B;\n\nThe apartment started to smell after just two days. I was given orange juice and sandwiches, but that was it. I stopped drinking the orange juice after I realized it smelled funny. I think they drugged it. I drank water from the tap instead. I was going mad imagining what they were doing out there.\n\nA few hours before dawn, I’d hear them leave the apartment. Maybe they thought I were asleep, but I was convinced they didn’t leave more than one or two kids behind to guard me. One of these mornings I finally worked up the courage to try and break out.\n\nThey always had kids stationed outside to guard me, but I was usually drugged up and asleep during the daytime. This time, when I’d skipped the orange juice, I was fine. When I finally worked up the courage to peek outside, I realized there was no one there. The bedroom was empty.\n\nI peeked into the living room.\n\n&#x200B;\n\nClouds of flies exploded as I opened the door. The smell stunned me. From just a quick peek I could see body parts scattered on the floor. A pile of wet clothes by the half-open, broken fridge. A torso propped up in the hallway, used as a knife block. Post-it notes with smileys and flowers on the kitchen counter. Bloodless, naked legs poking out of the blanket fort like stacked firewood. Cigarette butts were scattered around the kitchen area, sharing the space with maggots.\n\nStill, all that gore, and barely a drop of blood spilled.\n\nFredric was in the middle of the room. Levitating, two feet off the ground. Motionless, as if hung from an invisible string. Eyes closed. He didn’t breathe. His white tie spattered with red, his hair thick and unkempt. Long canines poking out from his drooping lower lip.\n\nMy mind broke. As my body relapsed into a panic, I burst through the bedroom door in a sprint. I couldn’t hear Fredric’s footsteps, but I knew he was right behind me.\n\n“Mom!” he laughed. “Mom, wait!”\n\nI slammed myself through the front door, and into the sunlight.\n\nAs I turned around, he was gone. A black shirt, a white tie and a pair of black jeans laid empty in the hallway. The light broke him.\n\n&#x200B;\n\nThe police didn’t know what to make of it, and there was even talks of bringing up charges against *me*. As if I’d made up the story about the kids in the first place. They’re still discussing it, but I’m not the main suspect. There were cameras who caught the victims walking into my apartment on their own. There was not a single captured image of any of the kids.\n\nNot even Fred. Not even when I knew he was right next to me, holding my hand.\n\nStill, there were plenty of witnesses. There had been kids there, no matter what the camera said. But it was hard to explain.\n\n&#x200B;\n\nI moved out in mid-March, and I’m living at an undisclosed location. The newspapers don’t know what to call these murders, and the sheriff’s office has forbidden me from leaving the state. I don’t know if you’ve even heard about it, most haven’t. I think there was a blurb about it in a local paper. I thought four dead people would be a bigger deal, but apparently there are “unclassified deaths” all the time. Funny how they’d lump this in the same category as someone getting crushed by a vending machine.\n\nBut for the past few nights, I’ve been getting a bad feeling. It started as just a feeling, at least, but there’s more to it. I think Fred and his gang are still out there, to some capacity. I’ve started noticing little flowery post-its at work. Some light switches needing an extra push.\n\nOr like just the other night. I was gonna watch a movie, so I got a coke from the fridge. Then and there, the light broke.\n\n&#x200B;\n\nAnd I swear, I heard a goddamn giggle outside the window.",
		"author_fullname": "t2_ks0de",
		"saved": true,
		"mod_reason_title": null,
		"gilded": 1,
		"clicked": false,
		"title": "The boy who broke the lights",
		"link_flair_richtext": [],
		"subreddit_name_prefixed": "r/nosleep",
		"hidden": false,
		"pwls": 6,
		"link_flair_css_class": null,
		"downs": 0,
		"thumbnail_height": null,
		"top_awarded_type": null,
		"hide_score": false,
		"name": "t3_oqdjrq",
		"quarantine": false,
		"link_flair_text_color": "dark",
		"upvote_ratio": 0.98,
		"author_flair_background_color": null,
		"subreddit_type": "public",
		"ups": 156,
		"total_awards_received": 3,
		"media_embed": {},
		"thumbnail_width": null,
		"author_flair_template_id": null,
		"is_original_content": false,
		"user_reports": [],
		"secure_media": null,
		"is_reddit_media_domain": false,
		"is_meta": false,
		"category": null,
		"secure_media_embed": {},
		"link_flair_text": null,
		"can_mod_post": false,
		"score": 156,
		"approved_by": null,
		"is_created_from_ads_ui": false,
		"author_premium": true,
		"thumbnail": "self",
		"edited": false,
		"author_flair_css_class": null,
		"author_flair_richtext": [],
		"gildings": {
			"gid_2": 1
		},
		"content_categories": [
			"writing"
		],
		"is_self": true,
		"mod_note": null,
		"created": 1627109580,
		"link_flair_type": "text",
		"wls": 6,
		"removed_by_category": null,
		"banned_by": null,
		"author_flair_type": "text",
		"domain": "self.nosleep",
		"allow_live_comments": false,
		"selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was raised in a foster home. I don’t have many memories from the time I spent with my biological parents, but I know they seriously mistreated us. Both me and my sister were both severely malnourished when the state took us in, and it stunted our growth pretty bad. My sister is about five feet tall, and I’m about an inch shorter.</p>\n\n<p>Being raised in a foster home, I was taught just how important it is to be mindful of others and care for those less fortunate. I’ve spent most of my adult life working with various charities. I also work as a nurse at a private hospital, and I spend most of my days providing palliative care. I hate to sound braggy, but I think I can safely say that I’m pulling my own weight. I care. That’s what I do.</p>\n\n<p>&#x200B;</p>\n\n<p>So it is no wonder that, once in a while, I care more than I should.</p>\n\n<p>&#x200B;</p>\n\n<p>I was coming home from work. It was a pretty late Thursday and most shops were closed, apart from a single convenience store. I bought myself a salad and a diet coke and followed the main street for about a block. I usually walk to and from work.</p>\n\n<p>With most shops closed, the place is a ghost town. Most bars and clubs are on a different street, but who goes clubbing on a Thursday anyway? No, apart from an older woman walking her dog, I was alone. I didn’t mind, I’d walked those streets a thousand times.</p>\n\n<p>There’s a fork in the road where they’ve put up pedestrian lights. Four roads meet, and it is by far the most infuriating intersection in town. As I rounded the corner, I saw someone standing there, pressing the button to cross.</p>\n\n<p>&#x200B;</p>\n\n<p>It was a kid. It wouldn’t matter how many times he pressed the button to cross, that light was broken. But he just stood there, crying, pressing the button. There wasn’t a single car on the road, but you know how kids are.</p>\n\n<p>He was about seven years old, with Asian features and a pale complexion. His eyes were red from crying, and he was shivering. It was mid-February, and there was still plenty of snow outside, yet he looked ready for summer.</p>\n\n<p>“Come on!” he cried. “Just… come on!”</p>\n\n<p>He kept pushing the button, but nothing happened. I walked up to him and crouched down to meet his eyes.</p>\n\n<p>“Hey there” I said. “Are you okay? Where are your parents?”</p>\n\n<p>He just pointed down the street and shook his head.</p>\n\n<p>“They went ahead” he said. “They left me.”</p>\n\n<p>“I’m sure it was a mistake. Wanna go find them?”</p>\n\n<p>“You can’t cross!” he cried. “It has to turn green!”</p>\n\n<p>“The light is broken, sweetie. You’ll be stuck here forever if you wait for it to turn green.”</p>\n\n<p>“Then how do I know when to cross?” he sniffled.</p>\n\n<p>I took his cold hand, met his brown eyes, and smiled.</p>\n\n<p>“Just come with me. We’ll find them.”</p>\n\n<p>That’s how I first met Fredric, or Fred. Such an adult name for such a scared little kid.</p>\n\n<p>&#x200B;</p>\n\n<p>Long story short, we didn’t find them. We searched for hours. When I called the police, I was told no one had reported a missing boy. He wasn’t being looked for, yet. As someone who had a vague memory of abusive and neglectful parents, I got a chill down my spine. Was this my time to step up and help out someone like me?</p>\n\n<p>Child protective services were eager to help, but the kid didn’t want to go with them. He wanted to stay with me. I had Friday off, and then there was the weekend, so I didn’t mind. I had to fill out a few forms, and they had to come back to my apartment to make sure it was safe, but that was it. It was just a temporary solution anyway, so they were pretty relaxed about it. A temporary foster home. What goes around comes around.</p>\n\n<p>During that whole time, that little hand never let go of me. He needed me.</p>\n\n<p>&#x200B;</p>\n\n<p>At the end of the night, he came home with me. I offered him my bed while I slept on the couch, but he refused. Instead, he wanted to sleep next to me. Of course he could. He had a shower, and I made him some juice and toast. We watched cartoons in bed until we fell asleep. That first night I stroked his hair and sang to him, like my foster parents had done to me all those years ago. He looked so peaceful.</p>\n\n<p>It wasn’t peaceful for long though. Sometime during the night, I woke up to the sound of someone vomiting. I rushed into the bathroom and switched on the lights, but it stayed dark. Fred was bent over the toilet with shallow breaths.</p>\n\n<p>“The light” he coughed. “It’s broken.”</p>\n\n<p>“I’ll fix it, sweetie. Are you okay?”</p>\n\n<p>“I’m allergic to oranges. I didn’t… I didn’t want you to get mad at me.”</p>\n\n<p>I comforted him as best as I could. I sat next to him for at least an hour. My legs got these square marks from the bathroom tiles.</p>\n\n<p>&#x200B;</p>\n\n<p>The next day, Fred stayed in bed. He said he was really tired, and that he just wanted to rest. He asked me to keep the blinds closed and the door shut, and to leave him some water. I was worried sick. At first I thought he had a fever, but then again, it could just be a stressed stomach. I figured he had to be going through hell, not knowing where his parents were, or why they’d left him. I put on the TV, left him some water, and told him I’d be in the next room whenever he wanted me to make him something.</p>\n\n<p>He stayed in bed until at least 6pm. All day. When he finally got up he seemed in much better spirits, and he munched down a plate of sausage and macaroni in an instant. He was so much more cheerful. A man from CPS came by with some extra clothes earlier in the day, so Fred got a fresh change. Looking at Fred that night, you couldn’t tell he’d been abandoned the day before. He was just an ordinary kid, eager to explore the world and make up new adventures.</p>\n\n<p>I brought an old butterfly net, and we went to catch moths in the park. I got us both a soda, and we walked around town playing Pokémon Go. Fred had a lot of opinions on the best evolution of Eevee, and he wouldn’t shut up about his favorite Pokémon; Gliscor.</p>\n\n<p>&#x200B;</p>\n\n<p>We were about to head back at 9pm, but Fred wanted a last walk by the monkey bars before we went home. I caved. We took the long route back home, so we’d walk past the monkey bars. Fred was way too happy for a kid who’d just lost his parents, but then again, maybe it wasn’t that much of a loss.</p>\n\n<p>There was another kid playing at the monkey bars. He was maybe a year older, with shoulder-length strawberry blonde hair. I thought it was a girl at first, but Fred seemed to know him.</p>\n\n<p>“Mom! Mom!” Fred called. “It’s Derek! Can I play with him?”</p>\n\n<p>Mom? I was already ‘mom’? I didn’t want to correct him, but that word hit me like a brick. Dumbfounded, I just nodded. Of course he had friends, but they were out way too late for kids this young.</p>\n\n<p>The two of them laughed and played until well past 10pm, when I convinced him it was time to go. They could play again tomorrow. It was too late. We got home, I drank a glass of orange juice, and we turned in for the night.</p>\n\n<p>&#x200B;</p>\n\n<p>The next day, I woke up at 11 am. I’d slept for almost 12 hours. The kind of sleep where, when you wake up, you barely know who you are anymore. I had an explosive headache, and I stumbled into the bathroom. I barely even thought about where Fred was. The bathroom light was still broken. My headache was so bad that I threw up. I tried my best to clean it up in the dark, but it was hard. The smell remained, even after a shower.</p>\n\n<p>I came out into the living room to find Fred and his friend Derek playing. Derek had brought an iPad, and they were taking turns looking at YouTube videos. They’d covered the windows to darken the room and made a blanket fort. Before I even got the time to question it, Fred hugged me.</p>\n\n<p>“I made you lunch” he said. “It’s in the fridge. I didn’t want to wake you.”</p>\n\n<p>I kissed his head and checked my phone. Four missed calls, all from CPS. I opened the fridge, but the light didn’t turn on. I could barely see anything. The fridge was still running. It was cold, but the light was busted. With the covered windows, and no other lights on, it was almost impossible to see what he’d made. Using my phone as a flashlight, I found a plate of ham and cheese sandwiches.</p>\n\n<p>Then, as I closed the fridge, I noticed two shining eyes looking back at me. Like the eyes of a cat, reflective, before they disappeared into the blanket fort. I barely had the time to register it before Fred interrupted my thoughts. He was standing in front of me, hands behind his back, looking worried.</p>\n\n<p>“Are you okay?” he asked, rocking back and forth.</p>\n\n<p>“I’m fine” I lied. “It’s just… the light is broken”</p>\n\n<p>“The light is broken” snickered Derek from the blanket fort.</p>\n\n<p>“Is Derek allowed to be here?” I asked. “We should call his parents.”</p>\n\n<p>“They’re working” said Derek from the fort. “But okay.”</p>\n\n<p>“You can have the number” said Fred. “Here.”</p>\n\n<p>He scribbled it on a post-it and handed it to me. The kids were so eager to get back to playing that I didn’t know how to handle it.</p>\n\n<p>&#x200B;</p>\n\n<p>I called Derek’s parents. They said everything was fine, and that he could stay as long as he wanted. They didn’t ask any follow-up questions, and they barely even cared about who I was or where I lived. They seemed irresponsible, quick to anger, and very busy. I couldn’t blame Derek for not wanting to spend time with them.</p>\n\n<p>Once it was dinner time I thought about making a chicken salad. Fred suggested we get pizza. Derek agreed. They were playing games on the iPad and watching cartoons, and as I knew this was a temporary arrangement, I couldn’t say no. They asked if they could stay at home while I got the pizza, and I said it was okay as long as they didn’t answer the door.</p>\n\n<p>“Thanks mom” said Fred. “You’re the best.”</p>\n\n<p>It didn’t sit right with me. I was just about to head out, but I turned at the door and met his eyes.</p>\n\n<p>“I’m not your mom, Fred”</p>\n\n<p>I don’t know why I said that. His gleeful expression faded from his eyes. With a completely deadpan expression, he responded.</p>\n\n<p>“Fine.”</p>\n\n<p>&#x200B;</p>\n\n<p>When I got back, the front door was unlocked. I hurried inside. Every single light in the apartment was broken by now. Every door was open. Every window was covered, and there was no one there. I dropped the pepperoni pizzas flat on the floor and called the police. My fingers trembled so bad I could barely type the number.</p>\n\n<p>A patrol car came by, and I talked to two officers. Apparently, there were still no reports of a missing child. They looked through the apartment, checked the blanket fort, and promised to search the area. There was nothing more to do at the moment. We called CPS, and I was told to update them as soon as I could. If Fred was some sort of flight risk he might need to stay at a more secure location.</p>\n\n<p>&#x200B;</p>\n\n<p>Later that night, I was alone in a dark apartment. Not a single light was working. As I sat down on my bed, I couldn’t help but to cry. I was so disappointed in myself for not being able to take care of this kid, to not being able to just live with that title of ‘mom’ without opening my stupid mouth. Of course he was upset, he was staying with a stranger. A stranger who didn’t want to be his mom. I couldn’t blame him.</p>\n\n<p>By midnight, I was exhausted. I just laid in bed, counting down from a thousand, hoping it’d put me to sleep. It didn’t.</p>\n\n<p>&#x200B;</p>\n\n<p>Somewhere around 2am I heard a noise from the living room. A chair moved. I hurried out, using my phone as a flashlight.</p>\n\n<p>I’ll never forget that sight. There were dozens of little eyes reflecting the light of my camera. At least 13 kids in the middle of my living room, cramped together. How did I not hear them enter?</p>\n\n<p>Sitting on a chair, facing the bedroom door, was Fred. He’d dressed up in a black shirt with a white tie and black jeans. It was something an adult would wear, not a kid. He got up on the kitchen chair, making himself just as tall as me.</p>\n\n<p>“What… what is this?” I stammered.</p>\n\n<p>There were all kinds of kids. Some as young as 4, maybe 5 years old. The oldest no more than 11.</p>\n\n<p>“A dignified and erstwhile undertaking” said Fred.</p>\n\n<p>He had a lower voice than before. His hair was combed and parted. Cared for.</p>\n\n<p>“Turn the fucking light off” he continued, pointing at me with a stiff finger.</p>\n\n<p>They pushed me down to the floor. Tiny hands held me down and covered my mouth. Fred towered above me with a kitchen knife as my phone went dark. The light broke. Even with no light in the room, their little eyes shone. I could see their perfectly white teeth, framed by blood red gums.</p>\n\n<p>“Pay attention and be respectful” Fred said, “and there’s a chance you’ll get out of this.”</p>\n\n<p>He made the rules perfectly clear. When they needed me, I’d answer the phone or turn away anyone who came knocking. I’d make up excuses. I’d do what I was told. I’d drink my orange juice and nod. That was it. In return, they wouldn’t kill me. This wasn’t “Fred” anymore. This was “Fredric”.</p>\n\n<p>I was locked in the bathroom. In the course of less than half an hour I’d gone from a grieving foster parent to a prisoner in my own apartment.</p>\n\n<p>&#x200B;</p>\n\n<p>This continued for several days. The lights were still broken, so I lived in complete darkness. Every now and then the phone rang, and a kid came in to let me answer. They all had knives, and if I stepped out of line they were ready to make short work of me. They all seemed so chipper and upbeat, not at all like a normal kid would be in this situation. There was something deeply wrong with them. These weren’t normal kids.</p>\n\n<p>In a couple of days, I only got a few calls. Once from work, where I had to explain I was really sick. I could barely breathe, having a knife pressed against my jugular. Two calls from the CPS, to make sure everything was fine and that I would come down to sign some papers at the end of the next 7-day period. One call from a work colleague who wanted to check if they should bring me anything.</p>\n\n<p>I would hear the kids go quiet at times. Moments later, the door would open. Sometimes I’d hear an adult voice, sometimes I’d just hear a dragging noise. Once, I heard a man asking about “the little girl”, only to be instantly silenced. I think they killed him.</p>\n\n<p>Sometimes, they’d all just start laughing. It happened spontaneously, and in unison. Empty-your-lungs kind of belly laughter, from a dozen kids, all at once. Some of them wouldn’t even laugh, they’d shriek and stomp.</p>\n\n<p>&#x200B;</p>\n\n<p>The apartment started to smell after just two days. I was given orange juice and sandwiches, but that was it. I stopped drinking the orange juice after I realized it smelled funny. I think they drugged it. I drank water from the tap instead. I was going mad imagining what they were doing out there.</p>\n\n<p>A few hours before dawn, I’d hear them leave the apartment. Maybe they thought I were asleep, but I was convinced they didn’t leave more than one or two kids behind to guard me. One of these mornings I finally worked up the courage to try and break out.</p>\n\n<p>They always had kids stationed outside to guard me, but I was usually drugged up and asleep during the daytime. This time, when I’d skipped the orange juice, I was fine. When I finally worked up the courage to peek outside, I realized there was no one there. The bedroom was empty.</p>\n\n<p>I peeked into the living room.</p>\n\n<p>&#x200B;</p>\n\n<p>Clouds of flies exploded as I opened the door. The smell stunned me. From just a quick peek I could see body parts scattered on the floor. A pile of wet clothes by the half-open, broken fridge. A torso propped up in the hallway, used as a knife block. Post-it notes with smileys and flowers on the kitchen counter. Bloodless, naked legs poking out of the blanket fort like stacked firewood. Cigarette butts were scattered around the kitchen area, sharing the space with maggots.</p>\n\n<p>Still, all that gore, and barely a drop of blood spilled.</p>\n\n<p>Fredric was in the middle of the room. Levitating, two feet off the ground. Motionless, as if hung from an invisible string. Eyes closed. He didn’t breathe. His white tie spattered with red, his hair thick and unkempt. Long canines poking out from his drooping lower lip.</p>\n\n<p>My mind broke. As my body relapsed into a panic, I burst through the bedroom door in a sprint. I couldn’t hear Fredric’s footsteps, but I knew he was right behind me.</p>\n\n<p>“Mom!” he laughed. “Mom, wait!”</p>\n\n<p>I slammed myself through the front door, and into the sunlight.</p>\n\n<p>As I turned around, he was gone. A black shirt, a white tie and a pair of black jeans laid empty in the hallway. The light broke him.</p>\n\n<p>&#x200B;</p>\n\n<p>The police didn’t know what to make of it, and there was even talks of bringing up charges against <em>me</em>. As if I’d made up the story about the kids in the first place. They’re still discussing it, but I’m not the main suspect. There were cameras who caught the victims walking into my apartment on their own. There was not a single captured image of any of the kids.</p>\n\n<p>Not even Fred. Not even when I knew he was right next to me, holding my hand.</p>\n\n<p>Still, there were plenty of witnesses. There had been kids there, no matter what the camera said. But it was hard to explain.</p>\n\n<p>&#x200B;</p>\n\n<p>I moved out in mid-March, and I’m living at an undisclosed location. The newspapers don’t know what to call these murders, and the sheriff’s office has forbidden me from leaving the state. I don’t know if you’ve even heard about it, most haven’t. I think there was a blurb about it in a local paper. I thought four dead people would be a bigger deal, but apparently there are “unclassified deaths” all the time. Funny how they’d lump this in the same category as someone getting crushed by a vending machine.</p>\n\n<p>But for the past few nights, I’ve been getting a bad feeling. It started as just a feeling, at least, but there’s more to it. I think Fred and his gang are still out there, to some capacity. I’ve started noticing little flowery post-its at work. Some light switches needing an extra push.</p>\n\n<p>Or like just the other night. I was gonna watch a movie, so I got a coke from the fridge. Then and there, the light broke.</p>\n\n<p>&#x200B;</p>\n\n<p>And I swear, I heard a goddamn giggle outside the window.</p>\n</div><!-- SC_ON -->",
		"likes": null,
		"suggested_sort": null,
		"banned_at_utc": null,
		"view_count": null,
		"archived": false,
		"no_follow": false,
		"is_crosspostable": true,
		"pinned": false,
		"over_18": false,
		"all_awardings": [
			{
				"giver_coin_reward": null,
				"subreddit_id": null,
				"is_new": false,
				"days_of_drip_extension": 0,
				"coin_price": 500,
				"id": "gid_2",
				"penny_donate": null,
				"award_sub_type": "GLOBAL",
				"coin_reward": 100,
				"icon_url": "https://www.redditstatic.com/gold/awards/icon/gold_512.png",
				"days_of_premium": 7,
				"tiers_by_required_awardings": null,
				"resized_icons": [
					{
						"url": "https://www.redditstatic.com/gold/awards/icon/gold_16.png",
						"width": 16,
						"height": 16
					},
					{
						"url": "https://www.redditstatic.com/gold/awards/icon/gold_32.png",
						"width": 32,
						"height": 32
					},
					{
						"url": "https://www.redditstatic.com/gold/awards/icon/gold_48.png",
						"width": 48,
						"height": 48
					},
					{
						"url": "https://www.redditstatic.com/gold/awards/icon/gold_64.png",
						"width": 64,
						"height": 64
					},
					{
						"url": "https://www.redditstatic.com/gold/awards/icon/gold_128.png",
						"width": 128,
						"height": 128
					}
				],
				"icon_width": 512,
				"static_icon_width": 512,
				"start_date": null,
				"is_enabled": true,
				"awardings_required_to_grant_benefits": null,
				"description": "Gives 100 Reddit Coins and a week of r/lounge access and ad-free browsing.",
				"end_date": null,
				"subreddit_coin_reward": 0,
				"count": 1,
				"static_icon_height": 512,
				"name": "Gold",
				"resized_static_icons": [
					{
						"url": "https://www.redditstatic.com/gold/awards/icon/gold_16.png",
						"width": 16,
						"height": 16
					},
					{
						"url": "https://www.redditstatic.com/gold/awards/icon/gold_32.png",
						"width": 32,
						"height": 32
					},
					{
						"url": "https://www.redditstatic.com/gold/awards/icon/gold_48.png",
						"width": 48,
						"height": 48
					},
					{
						"url": "https://www.redditstatic.com/gold/awards/icon/gold_64.png",
						"width": 64,
						"height": 64
					},
					{
						"url": "https://www.redditstatic.com/gold/awards/icon/gold_128.png",
						"width": 128,
						"height": 128
					}
				],
				"icon_format": null,
				"icon_height": 512,
				"penny_price": null,
				"award_type": "global",
				"static_icon_url": "https://www.redditstatic.com/gold/awards/icon/gold_512.png"
			},
			{
				"giver_coin_reward": 0,
				"subreddit_id": null,
				"is_new": false,
				"days_of_drip_extension": 0,
				"coin_price": 250,
				"id": "award_e03a0c52-56b5-45df-bd6f-5f2da10cfdc5",
				"penny_donate": 0,
				"award_sub_type": "GLOBAL",
				"coin_reward": 0,
				"icon_url": "https://www.redditstatic.com/gold/awards/icon/2Dread_512.png",
				"days_of_premium": 0,
				"tiers_by_required_awardings": null,
				"resized_icons": [
					{
						"url": "https://www.redditstatic.com/gold/awards/icon/2Dread_16.png",
						"width": 16,
						"height": 16
					},
					{
						"url": "https://www.redditstatic.com/gold/awards/icon/2Dread_32.png",
						"width": 32,
						"height": 32
					},
					{
						"url": "https://www.redditstatic.com/gold/awards/icon/2Dread_48.png",
						"width": 48,
						"height": 48
					},
					{
						"url": "https://www.redditstatic.com/gold/awards/icon/2Dread_64.png",
						"width": 64,
						"height": 64
					},
					{
						"url": "https://www.redditstatic.com/gold/awards/icon/2Dread_128.png",
						"width": 128,
						"height": 128
					}
				],
				"icon_width": 512,
				"static_icon_width": 512,
				"start_date": null,
				"is_enabled": true,
				"awardings_required_to_grant_benefits": null,
				"description": "A sense of impending doom",
				"end_date": null,
				"subreddit_coin_reward": 0,
				"count": 1,
				"static_icon_height": 512,
				"name": "Doom",
				"resized_static_icons": [
					{
						"url": "https://preview.redd.it/award_images/t5_22cerq/6syp1hxsqts61_Doom.png?width=16&height=16&auto=webp&s=5f202a5ac5aec91dba82d36301eaa7a5761fa325",
						"width": 16,
						"height": 16
					},
					{
						"url": "https://preview.redd.it/award_images/t5_22cerq/6syp1hxsqts61_Doom.png?width=32&height=32&auto=webp&s=3ac3cc0ced217f0ef9881a0a18494e7bed1d46bc",
						"width": 32,
						"height": 32
					},
					{
						"url": "https://preview.redd.it/award_images/t5_22cerq/6syp1hxsqts61_Doom.png?width=48&height=48&auto=webp&s=3762a197e5df6c2ed33c716a38358e81adf3a8e5",
						"width": 48,
						"height": 48
					},
					{
						"url": "https://preview.redd.it/award_images/t5_22cerq/6syp1hxsqts61_Doom.png?width=64&height=64&auto=webp&s=d89a1be27d378427250d106eedd5e88fd236bfd5",
						"width": 64,
						"height": 64
					},
					{
						"url": "https://preview.redd.it/award_images/t5_22cerq/6syp1hxsqts61_Doom.png?width=128&height=128&auto=webp&s=2a4b7adaebdd8d24eb4df2a1526a670cad15799e",
						"width": 128,
						"height": 128
					}
				],
				"icon_format": "APNG",
				"icon_height": 512,
				"penny_price": 0,
				"award_type": "global",
				"static_icon_url": "https://i.redd.it/award_images/t5_22cerq/6syp1hxsqts61_Doom.png"
			},
			{
				"giver_coin_reward": null,
				"subreddit_id": null,
				"is_new": false,
				"days_of_drip_extension": 0,
				"coin_price": 125,
				"id": "award_5f123e3d-4f48-42f4-9c11-e98b566d5897",
				"penny_donate": null,
				"award_sub_type": "GLOBAL",
				"coin_reward": 0,
				"icon_url": "https://i.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png",
				"days_of_premium": 0,
				"tiers_by_required_awardings": null,
				"resized_icons": [
					{
						"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=16&height=16&auto=webp&s=92932f465d58e4c16b12b6eac4ca07d27e3d11c0",
						"width": 16,
						"height": 16
					},
					{
						"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=32&height=32&auto=webp&s=d11484a208d68a318bf9d4fcf371171a1cb6a7ef",
						"width": 32,
						"height": 32
					},
					{
						"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=48&height=48&auto=webp&s=febdf28b6f39f7da7eb1365325b85e0bb49a9f63",
						"width": 48,
						"height": 48
					},
					{
						"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=64&height=64&auto=webp&s=b4406a2d88bf86fa3dc8a45aacf7e0c7bdccc4fb",
						"width": 64,
						"height": 64
					},
					{
						"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=128&height=128&auto=webp&s=19555b13e3e196b62eeb9160d1ac1d1b372dcb0b",
						"width": 128,
						"height": 128
					}
				],
				"icon_width": 2048,
				"static_icon_width": 2048,
				"start_date": null,
				"is_enabled": true,
				"awardings_required_to_grant_benefits": null,
				"description": "When you come across a feel-good thing.",
				"end_date": null,
				"subreddit_coin_reward": 0,
				"count": 1,
				"static_icon_height": 2048,
				"name": "Wholesome",
				"resized_static_icons": [
					{
						"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=16&height=16&auto=webp&s=92932f465d58e4c16b12b6eac4ca07d27e3d11c0",
						"width": 16,
						"height": 16
					},
					{
						"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=32&height=32&auto=webp&s=d11484a208d68a318bf9d4fcf371171a1cb6a7ef",
						"width": 32,
						"height": 32
					},
					{
						"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=48&height=48&auto=webp&s=febdf28b6f39f7da7eb1365325b85e0bb49a9f63",
						"width": 48,
						"height": 48
					},
					{
						"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=64&height=64&auto=webp&s=b4406a2d88bf86fa3dc8a45aacf7e0c7bdccc4fb",
						"width": 64,
						"height": 64
					},
					{
						"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=128&height=128&auto=webp&s=19555b13e3e196b62eeb9160d1ac1d1b372dcb0b",
						"width": 128,
						"height": 128
					}
				],
				"icon_format": null,
				"icon_height": 2048,
				"penny_price": null,
				"award_type": "global",
				"static_icon_url": "https://i.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png"
			}
		],
		"awarders": [],
		"media_only": false,
		"can_gild": true,
		"spoiler": false,
		"locked": false,
		"author_flair_text": null,
		"treatment_tags": [],
		"visited": false,
		"removed_by": null,
		"num_reports": null,
		"distinguished": null,
		"subreddit_id": "t5_2rm4d",
		"author_is_blocked": false,
		"mod_reason_by": null,
		"removal_reason": null,
		"link_flair_background_color": "",
		"id": "oqdjrq",
		"is_robot_indexable": true,
		"report_reasons": null,
		"author": "Saturdead",
		"discussion_type": null,
		"num_comments": 22,
		"send_replies": true,
		"whitelist_status": "all_ads",
		"contest_mode": false,
		"mod_reports": [],
		"author_patreon_flair": false,
		"author_flair_text_color": null,
		"permalink": "/r/nosleep/comments/oqdjrq/the_boy_who_broke_the_lights/",
		"parent_whitelist_status": "all_ads",
		"stickied": false,
		"url": "https://www.reddit.com/r/nosleep/comments/oqdjrq/the_boy_who_broke_the_lights/",
		"subreddit_subscribers": 14831411,
		"created_utc": 1627080780,
		"num_crossposts": 0,
		"media": null,
		"is_video": false,
		"comments": []
	}
]